Revit 2026 API

# IExternalServer Methods

---

The IExternalServer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetDescription | Implement this method to return a description of the server. |
|  | GetName | Implement this method to return the name of the server. |
|  | GetServerId | Implement this method to return the id of the server. |
|  | GetServiceId | Implement this method to return the id of the service. |
|  | GetVendorId | Implement this method to return the id of the vendor of the server. |

#### Reference

IExternalServer Interface

Autodesk.Revit.DB.ExternalService Namespace